package com.example.depi_final_project_bloodbank.domain.enums

object EgyptLocations {
    val governoratesMap = mapOf(
        "القاهرة" to listOf("مدينة نصر", "المعادي", "مصر الجديدة", "شبرا", "حلوان", "التجمع الخامس"),
        "الجيزة" to listOf("الدقي", "المهندسين", "الهرم", "فيصل", "6 أكتوبر", "الشيخ زايد"),
        "الإسكندرية" to listOf("سموحة", "سيدي بشر", "المنتزه", "محطة الرمل", "برج العرب", "العجمي"),
        "المنيا" to listOf("مركز المنيا", "سمالوط", "ملوي", "مغاغة", "بني مزار", "أبو قرقاص", "دير مواس", "مطاي", "العدوة"),
        "أسيوط" to listOf("مركز أسيوط", "ديروط", "القوصية", "أبنوب", "منفلوط", "أبو تيج", "الغنايم"),
        "سوهاج" to listOf("مركز سوهاج", "أخميم", "جرجا", "طهطا", "البلينا", "المراغة", "جهينة", "دار السلام"),
        "قنا" to listOf("مركز قنا", "نجع حمادي", "دشنا", "قوص", "فرشوط", "أبو تشت", "الوقف"),
        "الأقصر" to listOf("مدينة الأقصر", "إسنا", "أرمنت", "القرنة", "البياضية"),
        "أسوان" to listOf("مركز أسوان", "إدفو", "كوم أمبو", "نصر النوبة", "دراو"),
        "الدقهلية" to listOf("المنصورة", "طلخا", "ميت غمر", "دكرنس", "السنبلاوين", "بلقاس"),
        "الشرقية" to listOf("الزقازيق", "العاشر من رمضان", "منيا القمح", "بلبيس", "فاقوس"),
        "الغربية" to listOf("طنطا", "المحلة الكبرى", "زفتى", "كفر الزيات", "السنطة"),
        "المنوفية" to listOf("شبين الكوم", "منوف", "أشمون", "قويسنا", "تلا"),
        "البحيرة" to listOf("دمنهور", "كفر الدوار", "رشيد", "إيتاي البارود", "أبو حمص")
        // تقدر تزود باقي المحافظات هنا بنفس الطريقة
    )

    val allGovernorates = governoratesMap.keys.toList()
}